In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("C:/Users/chinm/Downloads/others/projects/nn project/adult.data", delimiter=",")

In [3]:
df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

### Transforming data

In [4]:
df.columns = ['Age', 'WorkClass', 'Fnlwgt', 'Education', 'Education-NUM', 'Marital-Status', 'Occupation', 'Relationship', 'Race', 'Sex', 'Capital-Gain', 'Capital-Loss', 'Hours-Per-Week', 'Native-Country', 'Salary']

In [5]:
df.head()

,Age,WorkClass,Fnlwgt,Education,Education-NUM,Marital-Status,Occupation,Relationship,Race,Sex,Capital-Gain,Capital-Loss,Hours-Per-Week,Native-Country,Salary
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [6]:
#Removing extra trailing spaces from each value
df = df.map(lambda x: x.strip() if isinstance(x, str) else x)

### Data Cleaning

In [7]:
#Searching for empty or irrelevant data
question_mark_counts = df.apply(lambda col: (col == '?').sum())
question_mark_counts

Age                  0
WorkClass         1836
Fnlwgt               0
Education            0
Education-NUM        0
Marital-Status       0
Occupation        1843
Relationship         0
Race                 0
Sex                  0
Capital-Gain         0
Capital-Loss         0
Hours-Per-Week       0
Native-Country     583
Salary               0
dtype: int64

In [11]:
df.replace('?', np.nan, inplace=True)
df.isna().sum()

In [ ]:
df.dropna(inplace=True)

In [12]:
df.isna().sum()

Age               0
WorkClass         0
Fnlwgt            0
Education         0
Education-NUM     0
Marital-Status    0
Occupation        0
Relationship      0
Race              0
Sex               0
Capital-Gain      0
Capital-Loss      0
Hours-Per-Week    0
Native-Country    0
Salary            0
dtype: int64

In [14]:
df.shape

(30161, 15)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30161 entries, 0 to 32559
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Age             30161 non-null  int64
 1   WorkClass       30161 non-null  object
 2   Fnlwgt          30161 non-null  int64
 3   Education       30161 non-null  object
 4   Education-NUM   30161 non-null  int64
 5   Marital-Status  30161 non-null  object
 6   Occupation      30161 non-null  object
 7   Relationship    30161 non-null  object
 8   Race            30161 non-null  object
 9   Sex             30161 non-null  object
 10  Capital-Gain    30161 non-null  int64
 11  Capital-Loss    30161 non-null  int64
 12  Hours-Per-Week  30161 non-null  int64
 13  Native-Country  30161 non-null  object
 14  Salary          30161 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [16]:
df.describe()

,Age,Fnlwgt,Education-NUM,Capital-Gain,Capital-Loss,Hours-Per-Week
count,30161.000000,3.016100e+04,30161.000000,30161.000000,30161.000000,30161.000000
mean,38.437883,1.897976e+05,10.121216,1091.971984,88.375419,40.931269
std,13.134882,1.056527e+05,2.549983,7406.466659,404.304753,11.980182
min,17.000000,1.376900e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.176280e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.784290e+05,10.000000,0.000000,0.000000,40.000000
75%,47.000000,2.376300e+05,13.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

### Questions

In [17]:
''' 
How many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels. (race column)
What is the average age of men?
What is the percentage of people who have a Bachelor's degree?
What percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K?
What percentage of people without advanced education make more than 50K?
What is the minimum number of hours a person works per week?
What percentage of the people who work the minimum number of hours per week have a salary of more than 50K?
What country has the highest percentage of people that earn >50K and what is that percentage?
Identify the most popular occupation for those who earn >50K in India.
'''

" \nHow many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels. (race column)\nWhat is the average age of men?\nWhat is the percentage of people who have a Bachelor's degree?\nWhat percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K?\nWhat percentage of people without advanced education make more than 50K?\nWhat is the minimum number of hours a person works per week?\nWhat percentage of the people who work the minimum number of hours per week have a salary of more than 50K?\nWhat country has the highest percentage of people that earn >50K and what is that percentage?\nIdentify the most popular occupation for those who earn >50K in India.\n"

### Answers

In [18]:
race_counts = df['Race'].value_counts()

#### How many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels. (race column)

In [19]:
print("count of person in each race")
race_counts

count of person in each race

Race
White                 25932
Black                  2817
Asian-Pac-Islander      895
Amer-Indian-Eskimo      286
Other                   231
Name: count, dtype: int64

#### What is the average age of men?

In [20]:
print("Average age of person :", round(df['Age'].mean()))

Average age of person : 38

#### What is the percentage of people who have a Bachelor's degree?

In [35]:
total = df.shape[0]

In [41]:
df['Education'] = df['Education'].str.lower()
bachelors_count = len(df[df['Education'] == 'bachelors'])

In [42]:
percent_of_bachelors = (bachelors_count/total) * 100

In [43]:
print("percent of bachelors :" ,round(percent_of_bachelors,2),'%')

percent of bachelors : 16.72 %

#### What percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K?

In [44]:
df['Education'].unique()

array(['bachelors', 'hs-grad', '11th', 'masters', '9th', 'some-college',
       'assoc-acdm', '7th-8th', 'doctorate', 'assoc-voc', 'prof-school',
       '5th-6th', '10th', 'preschool', '12th', '1st-4th'], dtype=object)

In [45]:
tilit = df[((df['Education'] == 'bachelors') | (df['Education'] == 'masters') | (df['Education'] == 'doctorate') ) & (df['Salary'] == '>50K')]
tilit.head()

,Age,WorkClass,Fnlwgt,Education,Education-NUM,Marital-Status,Occupation,Relationship,Race,Sex,Capital-Gain,Capital-Loss,Hours-Per-Week,Native-Country,Salary
7,31,Private,45781,masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
8,42,Private,159449,bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
10,30,State-gov,141297,bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K
18,43,Self-emp-not-inc,292175,masters,14,Divorced,Exec-managerial,Unmarried,White,Female,0,0,45,United-States,>50K
19,40,Private,193524,doctorate,16,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,60,United-States,>50K

In [46]:
print('percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K : ', round((len(tilit)/total)*100, 2), "%")

percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K :  11.02 %

#### What percentage of people without advanced education make more than 50K?

In [47]:
no_tilit = df[((df['Education'] != 'bachelors') | (df['Education'] != 'masters') | (df['Education'] != 'doctorate') ) & (df['Salary'] == '>50K')]
no_tilit.head()

,Age,WorkClass,Fnlwgt,Education,Education-NUM,Marital-Status,Occupation,Relationship,Race,Sex,Capital-Gain,Capital-Loss,Hours-Per-Week,Native-Country,Salary
6,52,Self-emp-not-inc,209642,hs-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
7,31,Private,45781,masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
8,42,Private,159449,bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
9,37,Private,280464,some-college,10,Married-civ-spouse,Exec-managerial,Husband,Black,Male,0,0,80,United-States,>50K
10,30,State-gov,141297,bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K

In [48]:
print('percentage of people without advanced education make more than 50K', round((len(no_tilit)/total)*100,2),'%')

percentage of people without advanced education make more than 50K 24.89 %

#### What is the minimum number of hours a person works per week?

In [49]:
print('minimum number of hours a person works per week is :', df['Hours-Per-Week'].min())

minimum number of hours a person works per week is : 1

#### What percentage of the people who work the minimum number of hours per week have a salary of more than 50K?

In [50]:
min_sal_hpw = df[(df['Hours-Per-Week'] == 1) & (df['Salary'] == '>50K')]
min_sal_hpw

,Age,WorkClass,Fnlwgt,Education,Education-NUM,Marital-Status,Occupation,Relationship,Race,Sex,Capital-Gain,Capital-Loss,Hours-Per-Week,Native-Country,Salary
188,58,State-gov,109567,doctorate,16,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,1,United-States,>50K

In [51]:
print('percentage of the people working min hours with more than 50K :', round((len(min_sal_hpw)/total)*100, 4),'%')

percentage of the people working min hours with more than 50K : 0.0033 %

#### What country has the highest percentage of people that earn >50K and what is that percentage?

In [52]:
new_df = df[df['Salary'] == '>50K']

In [62]:
new_df.head()

,Age,WorkClass,Fnlwgt,Education,Education-NUM,Marital-Status,Occupation,Relationship,Race,Sex,Capital-Gain,Capital-Loss,Hours-Per-Week,Native-Country,Salary
6,52,Self-emp-not-inc,209642,hs-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
7,31,Private,45781,masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
8,42,Private,159449,bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
9,37,Private,280464,some-college,10,Married-civ-spouse,Exec-managerial,Husband,Black,Male,0,0,80,United-States,>50K
10,30,State-gov,141297,bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K

In [55]:
new_df['Native-Country'].value_counts()

Native-Country
United-States         6995
Philippines             60
Germany                 44
India                   40
Canada                  36
Mexico                  33
England                 30
Cuba                    25
Italy                   24
Japan                   23
China                   20
Taiwan                  19
Iran                    18
South                   14
Puerto-Rico             12
France                  12
Poland                  11
Jamaica                 10
El-Salvador              9
Greece                   8
Cambodia                 7
Yugoslavia               6
Hong                     6
Vietnam                  5
Ireland                  5
Portugal                 4
Haiti                    4
Ecuador                  4
Guatemala                3
Hungary                  3
Thailand                 3
Nicaragua                2
Scotland                 2
Trinadad&Tobago          2
Laos                     2
Columbia                 2
Dominican-Republic       2
Peru                     2
Honduras                 1
Name: count, dtype: int64

In [58]:
high_sal_country = new_df[new_df['Native-Country'] == 'United-States']

In [60]:
len(high_sal_country)

6995

In [64]:
print('United States has highest salary worker :', round((len(high_sal_country)/total)*100, 2), '%')

United States has highest salary worker : 23.19 %

#### Identify the most popular occupation for those who earn >50K in India.

In [65]:
new_df['Occupation'].value_counts()

Occupation
Exec-managerial      1937
Prof-specialty       1811
Sales                 970
Craft-repair          908
Adm-clerical          498
Transport-moving      319
Tech-support          278
Machine-op-inspct     245
Protective-serv       210
Other-service         132
Farming-fishing       115
Handlers-cleaners      83
Armed-Forces            1
Priv-house-serv         1
Name: count, dtype: int64

In [67]:
print('The most popular occupation is Exec-managerial.')

The most popular occupation is Exec-managerial.